# Core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# CLI tools
brew 'coreutils'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'zsh'
brew 'wget'
brew 'certbot'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'asdf'

# Casks
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'

# Fonts
cask 'font-blexmono-nerd-font'
cask 'font-firacode-nerd-font-mono'
cask 'font-hack-nerd-font'
cask 'font-sourcecodepro-nerd-font'
