# Core
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


# cli tools
brew 'coreutils'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'hub'
brew 'neofetch'
brew 'neovim'
brew 'openssl'
brew 'shellcheck'
brew 'tmux'
brew 'tree'
brew 'zsh'


# casks
cask 'alfred'
cask 'android-file-transfer'
cask 'docker'
cask 'firefox-developer-edition'
cask 'google-chrome'
cask 'iina'
cask 'postman'
cask 'slack'
cask 'spark'
cask 'spotify'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'

# Fonts
cask 'font-firacode-nerd-font-mono'
cask 'font-hack-nerd-font'
cask 'font-sourcecodepro-nerd-font'